{
  "info": [
    {
      "type": "h1",
      "content": "sql для начинающих"
    },
    {
      "type": "p",
      "content": "👉 Система управления базами данных (СУБД) — это отдельная программа, которая работает как сервер, независимо от PHP.\n\n"
    },
    {
      "type": "p",
      "content": "Создавать свои базы данных, таблицы и наполнять их данными можно прямо из этой же программы, но для выполнения этих операций прежде придётся познакомиться с ещё одним языком программирования — SQL.\n\n"
    },
    {
      "type": "p",
      "content": "SQL или Structured Query Language (язык структурированных запросов) — язык программирования, предназначенный для управления данными в СУБД. Все современные СУБД поддерживают SQL.\n\n"
    },
    {
      "type": "p",
      "content": "На языке SQL выражаются все действия, которые можно провести с данными: от записи и чтения данных, до администрирования самого сервера СУБД. Для повседневной работы совсем не обязательно знать весь этот язык; достаточно ознакомиться лишь с основными понятиями синтаксиса и ключевыми словами.\n\n"
    },
    {
      "type": "p",
      "content": "Кроме того, SQL очень простой язык по своей структуре, поэтому его освоение не составит большого труда.\n\n"
    },
    {
      "type": "p",
      "content": "Язык SQL — это в первую очередь язык запросов, а кроме того он очень похож на естественный язык. Каждый раз, когда требуется прочитать или записать любую информацию в БД, требуется составить корректный запрос. Такой запрос должен быть выражен в терминах SQL.\n\n"
    },
    {
      "type": "code",
      "content": "ПРОЧИТАТЬ всё ИЗ ТАБЛИЦЫ 'города'\n"
    },
    {
      "type": "p",
      "content": "Если перевести этот запрос на язык SQL, то корректным результатом будет:\n\n"
    },
    {
      "type": "code",
      "content": "SELECT * FROM 'cities'\n"
    },
    {
      "type": "p",
      "content": "Теперь напишем запрос на добавление в таблицу города нового города:\n\n"
    },
    {
      "type": "code",
      "content": "ВСТАВЬ В ТАБЛИЦУ 'города' ЗНАЧЕНИЯ 'имя города' = 'Санкт-Петербург'\n"
    },
    {
      "type": "p",
      "content": "Перевод на SQL:\n\n"
    },
    {
      "type": "code",
      "content": "INSERT INTO 'cities' SET 'name' = 'Санкт-Петербург'\n"
    },
    {
      "type": "p",
      "content": "Эта команда создаст в таблице города новую запись, где полю имя города будет присвоено значение Санкт-Петербург.\n\n"
    },
    {
      "type": "p",
      "content": "С помощью SQL можно не только добавлять и читать данные, но и:\n\n"
    },
    {
      "type": "li",
      "content": "удалять и обновлять записи в таблицах;\n"
    },
    {
      "type": "li",
      "content": "создавать и редактировать сами таблицы;\n"
    },
    {
      "type": "li",
      "content": "производить операции над данными: считать сумму, получать самое большое или малое значение, и так далее;\n"
    },
    {
      "type": "li",
      "content": "настраивать работу сервера СУБД.\n"
    },
    {
      "type": "h1",
      "content": "MySQL"
    },
    {
      "type": "p",
      "content": "Существует множество различных реляционных СУБД. Самая известная СУБД — это Microsoft Access, входящая в состав офисного пакета приложений Microsoft Office. Нет никаких препятствий для использования в качестве СУБД MS Access, но для задач веб-программирования гораздо лучше подходит альтернативная программа — MySQL.\n\n"
    },
    {
      "type": "p",
      "content": "В отличие от MS Access, MySQL абсолютно бесплатна, может работать на серверах с Linux, обладает гораздо большей производительностью и безопасностью, что делает её идеальным кандидатом на роль базы данных в веб-разработке.\n\n"
    },
    {
      "type": "p",
      "content": "Подавляющее большинство сайтов и приложений на PHP используют в качестве СУБД именно MySQL.\n\n"
    },
    {
      "type": "h1",
      "content": "Установка"
    },
    {
      "type": "p",
      "content": "Последняя версия MySQL доступна для загрузки по ссылке: https://dev. mysql. com/downloads/mysql/. На этой странице следует выбрать MySQL Installer for Windows и нажать на кнопку Download для загрузки.\n\n"
    },
    {
      "type": "p",
      "content": "В процессе установки запомните директорию, куда вы устанавливаете MySQL (скрывается под ссылкой Advanced options). На шаге Accounts and Roles установщик попросит придумать пароль для доступа к БД (MySQL Root Password) — обязательно запомните или запишите этот пароль — он вам ещё понадобится.\n\n"
    },
    {
      "type": "p",
      "content": "Если для своей работы вы используете программную среду OpenServer, то этот раздел можно смело пропустить, так как в состав OpenServer уже входит свежая версия MySQL.\n\n"
    },
    {
      "type": "h1",
      "content": "Выполнение запросов\n"
    },
    {
      "type": "p",
      "content": "По умолчанию, если вы не устанавливали дополнительные программы, у MySQL нет графического интерфейса пользователя. Это значит, что единственный способ работы с ней — это использование командной строки.\n\n"
    },
    {
      "type": "li",
      "content": "Откройте командную строку (Выполнить — cmd.exe).\n"
    },
    {
      "type": "li",
      "content": "Перейдите в каталог с установленной MySQL: cd /d <каталог установки>/bin.\n"
    },
    {
      "type": "li",
      "content": "Выполните: mysql -uroot -p.\n"
    },
    {
      "type": "li",
      "content": "Введите пароль, заданный при установке.\n"
    },
    {
      "type": "p",
      "content": "Если вы всё выполнили верно, то в командной строке запустится клиент для работы с MySQL (вы поймете это по строке приглашения «mysql>»). С этого момента можно вводить любые SQL запросы, но каждый запрос обязательно должен заканчиваться точкой с запятой ;.\n\n"
    }
  ],
  "video": "https://www.youtube.com/embed/IK6e1SFCdow",
  "tasks": [
    "Создать базу данных",
    "Применить JOINS",
    "Применить GROUP BY",
    "Применить UPDATE",
    "Применить WHERE"
  ],
  "result": "sql.png",
  "test": {
    "head": "Тест для закрепления материала",
    "body": [
      {
        "title": "Что такое sql?",
        "content": [
          {
            "title": "Система управления базами данных (СУБД) — это отдельная программа, которая работает как сервер, независимо от PHP.\n\n",
            "result": true
          },
          {
            "title": "База данных",
            "result": true
          },
          {
            "title": "NoSQL",
            "result": false
          }
        ]
      },
      {
        "title": "Какого оператора нет в sql?",
        "content": [
          {
            "title": "&",
            "result": true
          },
          {
            "title": "+",
            "result": false
          },
          {
            "title": "-",
            "result": false
          }
        ]
      },
      {
        "title": "Какой оператор есть в sql?",
        "content": [
          {
            "title": "&",
            "result": false
          },
          {
            "title": "#",
            "result": false
          },
          {
            "title": "+",
            "result": true
          }
        ]
      }
    ]
  }
}